# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Nick\Documents\PSoC Creator\NeoPixel\NeoPixel.cydsn\NeoPixel.cyprj
# Date: Wed, 02 Dec 2015 09:54:07 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 19.6078431372549 -waveform {0 9.80392156862745} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 19.6078431372549 -waveform {0 9.80392156862745} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 9} [list [get_pins {ClockBlock/dclk_glb_0}]]


# Component constraints for C:\Users\Nick\Documents\PSoC Creator\NeoPixel\NeoPixel.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Nick\Documents\PSoC Creator\NeoPixel\NeoPixel.cydsn\NeoPixel.cyprj
# Date: Wed, 02 Dec 2015 09:54:05 GMT
